{
  "games": [
    {
      "category": "Jobs",
      "question_array": [
        {
          "question": "After highschool I learnt to work in a team...",
          "point": 100,
          "info": "I did not kill anybody",
          "answer_array": ["Soldier at Bornholm","Falck-savior in Løkken","Bartender in London","Dishwasher at Bakken"]
        },
        {
          "question": "What was my job at IBM Learning Service?",
          "point": 200,
          "info": "Working with learning",
          "answer_array": ["E-learning developer","Selling hardware","Opdating mainframe-databases"
          ,"Controlling large projects"]
        },
        {
          "question": "What was my job at the agency Kidvertising?",
          "point": 300,
          "info": "Something with code",
          "answer_array": ["Developing web solutions","Art director","Project manager","Designer"]
        },
        {
          "question": "What was my job at the publisher Turbineforlaget?",
          "point": 400,
          "info": "I developed in HTML5, JavaScript, JQuery, CSS, PHP,MySql and XML",
          "answer_array": ["Developed an interactive platform to children.","Write books about IT to Children","Updating turbine.dk","Draws a univers for children"]
        },
        {
          "question": "What was my job at Bestseller IT?",
          "point": 500,
          "info": "Min primære jobbeskrivelse i Team e-learning var: 'Ansvarlig for det tekniske setup, vidensdeling samt at udvikle interaktive elementer til kurserne', men jeg var med i alle faser af projekterne.",
          "answer_array": ["Ansvarlig for det tekniske setup, vidensdeling samt interaktive elementer til kurserne","Ansvarlig for design","Projektleder og teamets ansigt","Korrektur og test"]
        }
      ]
    },
    {
      "category": "Behind the quiz",
      "question_array": [
        {
          "question": "Hvilket framework er quizzen udviklet i?",
          "point": 100,
          "info": "Min quiz er udviklet i React, TypeScript, CSS3, HTML5.",
          "answer_array": ["React og TypeScript","Angular","Vue","Ren JavaScript"]
        },
        {
          "question": "Hvor mange forskellige slags komponenter består spillet af?",
          "point": 200,
          "info": "Spillet består af komponenterne Game, Question, Answer og Info.",
          "answer_array": ["4","1","2","3"]
        },
        {
          "question": "Spillets data...?",
          "point": 300,
          "info": "Spillet er gemt i en JSON-fil, som er formateret på samme måde som mine quizzer på min blog unitedman.dk.",
          "answer_array": ["Kommer fra en JSON-fil","Kommer fra MS SQL","Er hardcodet i komponenten Info","Kommer fra NoSQL-database"]
        },
        {
          "question": "Info-komponenten, som viser et pop-up-vindue, når brugeren markerer 'Læs mere...'-knappen, er...",
          "point": 400,
          "info": "Rodal er et npm-bibliotek med mange features. Eksempelvis kan jeg vælge mange forskellige animationsformer, når vinduet vises. De mange biblioteker til rådighed er en af Reacts store fordele.",
          "answer_array": ["Et npm-bibliotek, som hedder Rodal","En indbygget feature i React","En feature i JQuery","En feature, jeg selv har udviklet fra bunden"]
        },
        {
          "question": "Denne quiz viser, at jeg kan udvikle i React, men hvilket JavaScript-bibliotek er mest efterspurgt på arbejdsmarkedet lige nu?",
          "point": 500,
          "info": "Ifølge en undersøgelse fra https://da.bccrwp.org/ af 60.000 jobopslag er React klart mest efterspurgt, mens Angular indtager pladsen som nummer to.",
          "answer_array": ["React","answer", "Angular","Vue.js","JQuery"]
        }
      ]
    },
    {
      "category": "Solutions",
      "question_array": [
        {
          "question": "TIl hvilken kunde udviklede jeg den digitale udgave af Sudoku, som blev et af de mest populære online-spil i Danmark det år?",
          "point": 100,
          "info": "Samarbejdet med TV2 varede i nogle år, og der kom mange andre spil til undervejs. Jeg lærte at reagere hurtigt, når TV2's mange brugere fandt fejl eller ønskede nye features.",
          "answer_array": ["spil.tv2.dk","Danfoss","TDC","Grundfos"]
        },
        {
          "question": "Hvilken stor dansk virksomhed udviklede jeg julekalender til i en årrække?",
          "point": 200,
          "info": "Den interaktive julekalender skabte opmærksomhed om firmaets produkter. Danfoss' professionelle og dygtige medarbejdere var med til at gøre mig til en bedre udvikler med stort fokus på kvalitet.",
          "answer_array": ["Danfoss","Finanssektorens Uddannelsescenter","TDC","Maersk Containere"]
        },
        {
          "question": "Hvad bestod mit iværksætterprojekt, som jeg arbejdede på fra 2015-17, af?",
          "point": 300,
          "info": "Mit iværksættereventyr teacher-content.com var et læringssite på ni sprog med fokus på viden om verden.",
          "answer_array": ["Læringsspil på ni sprog","En ny og epokegørende betalingsløsning","Tøj til hunde","Et filosofisk univers til børnehavebørn"]
        },
        {
          "question": "Hvilket dansk firma blev min første store kunde? Et samarbejde, som strakte sig over en del år med flere store e-learningskurser, der blev indledt af selveste Henning Dyremose.",
          "point": 400,
          "info": "Igennem årene lavede jeg blandt andet miljøkampagne, arbejdsmiljøkursus, skriftlig kommunikation, leverandør-database og store kampagnesites. Samarbejdet lærte mig at være den teknisk ansvarlige i samarbejde med mange forskellige afdelinger i det landsdækkende firma.",
          "answer_array": ["TDC","Knauf A/S","Aarhus Stiftstidende","Egmont"]
        },
        {
          "question": "Som teknisk ansvarlig for Team e-learning var jeg den drivende kraft i at gøre dette firmas læringsunivers mobilvenligt. Hvilket firma?",
          "point": 500,
          "info": "På to år som teknisk ansvarlig fik vi gjort firmaets Content Learning System og de nye kurser mobilvenlige, sprogversionerede og meget mere interaktive.",
          "answer_array": ["Bestseller","TDC","Danfoss","Grundfos"]
        }
      ]
    },
    {
      "category": "Behind Brian",
      "question_array": [
        {
          "question": "Hvad gør lørdag den 20. februar 2021 speciel for Brian",
          "point": 100,
          "info": "på rådhuset blev jeg gift med min kone Janni Iben.",
          "answer_array": ["Jeg blev gift!","Manchester United vandt!","Jeg vandt i lotto!","Min ældste datter blev konfirmeret!"]
        },
        {
          "question": "Hvad gør mandag den 22. februar speciel for Brian?",
          "point": 200,
          "info": "Dejligt at jeg lige nåede at blive gift inden min fødselsdag :-)",
          "answer_array": ["Jeg fyldte 50 år","Det er min fødselsdag","Jeg løb mit første halvmaraton","4"]
        },
        {
          "question": "Hvor mange maratonløb har jeg løbet",
          "point": 300,
          "info": "Jeg har løbet maraton i Paris, London, Berlin og Odense. Før jeg blev en glad løber, cyklede jeg en del og har cyklet Sjælland Rundt, Vettern Rundt og Aarhus-København.",
          "answer_array": ["4","1","2","3"]
        },
        {
          "question": "Jeg solgte domænenavnet www.spil.nu i 2014. Hvad tror I, at jeg fik for det?",
          "point": 400,
          "info": "Pengene brugte jeg til at købe mig selv fri til at starte mit iværksætterprojekt med læringsspil til folkeskolen.",
          "answer_array": ["400.000 kroner","17.000 og en iPhone","To uger i et sommerhus i Marbella","spilnu.dk fik domænenavnet gratis"]
        },
        {
          "question": "Hvor mange besøgende har mine læringsspil haft over tid?",
          "point": 500,
          "info": "Jeg er stolt over, at så mange børn er blevet klogere ved at spille mine spil.",
          "answer_array": ["2.500.000 brugere","1.500.000 brugere","500.000 brugere","4.000.000 brugere"]
        }
      ]
    }
  ]
}
